Repository: T8RIN/ImageToolbox
Catalog: ios/ImageToolbox/Resources/Localizable.xcstrings
Source language: en
Languages: ru

source: %@, %lld x %lld
ru: %@, %lld × %lld

source: %lld colours
ru: Цветов: %lld

source: %lld exact groups, %lld similar groups
ru: Точных групп: %lld, похожих групп: %lld

source: %lld pictures could not be read.
ru: Не удалось прочитать изображений: %lld.

source: %lld selected
ru: Выбрано: %lld

source: %lld × %lld px
ru: %lld × %lld пикс.

source: APNG tools
ru: Инструменты APNG

source: ASCII art
ru: ASCII-арт

source: Add stop
ru: Добавить опорную точку

source: Address
ru: Адрес

source: After
ru: После

source: Algorithm
ru: Алгоритм

source: Analogous
ru: Аналогичные

source: And %lld more rows.
ru: И ещё строк: %lld.

source: Angle
ru: Угол

source: Apache License 2.0
ru: Лицензия Apache 2.0

source: App logs
ru: Журнал приложения

source: Apple SDK License
ru: Лицензия Apple SDK

source: Apple frameworks
ru: Фреймворки Apple

source: Apply profile
ru: Применить профиль

source: Apply watermark
ru: Применить водяной знак

source: Area
ru: Область

source: Arrow
ru: Стрелка

source: Aspect
ru: Соотношение сторон

source: Audio cover extractor
ru: Извлечение обложки из аудио

source: Average
ru: Среднее

source: Background
ru: Фон

source: Base colour
ru: Базовый цвет

source: Base64 to Image
ru: Base64 в изображение

source: Batch rename
ru: Пакетное переименование

source: Before
ru: До

source: Bookmark
ru: Закладка

source: Build mosaic
ru: Собрать мозаику

source: Building…
ru: Сборка…

source: Burger
ru: Бургер

source: Cancel
ru: Отмена

source: Celebrate
ru: Праздновать

source: Checksum name
ru: Имя по чексумме

source: Checksums
ru: Контрольные суммы

source: Chevron
ru: Шеврон

source: Choose GIF
ru: Выбрать GIF

source: Choose PNG
ru: Выбрать PNG

source: Choose WebP
ru: Выбрать WebP

source: Choose at least one frame.
ru: Выберите хотя бы один кадр.

source: Choose at least two images.
ru: Выберите хотя бы два изображения.

source: Choose audio file
ru: Выбрать аудиофайл

source: Choose document photo
ru: Выбрать фото документа

source: Choose file
ru: Выбрать файл

source: Choose frames
ru: Выбрать кадры

source: Choose image
ru: Выбрать изображение

source: Choose images
ru: Выбрать изображения

source: Choose mask picture
ru: Выбрать изображение-маску

source: Choose overlay
ru: Выбрать наложение

source: Choose photo
ru: Выбрать фото

source: Choose picture
ru: Выбрать изображение

source: Choose pictures
ru: Выбрать изображения

source: Choose pictures to see the new names.
ru: Выберите изображения, чтобы увидеть новые имена.

source: Choose screenshot
ru: Выбрать скриншот

source: Clover
ru: Клевер

source: Code
ru: Код

source: Code preview
ru: Предпросмотр кода

source: Color
ru: Цвет

source: Color library
ru: Библиотека цветов

source: Color picker
ru: Пипетка

source: Color tools
ru: Инструменты цвета

source: Colour
ru: Цвет

source: Colours
ru: Цвета

source: Columns
ru: Столбцы

source: Compare
ru: Сравнение

source: Compare images
ru: Сравнение изображений

source: Compare with
ru: Сравнить с

source: Complementary
ru: Дополнительный

source: Compute
ru: Вычислить

source: Copies EXIF, GPS and other tags into exported files. Off by default, so exports carry no location.
ru: Копирует в сохраняемые файлы EXIF, GPS и другие теги. По умолчанию выключено, поэтому в файлах нет геопозиции.

source: Copy
ru: Скопировать

source: Copy hex
ru: Скопировать HEX

source: Corner radius
ru: Радиус скругления

source: Could not apply the watermark.
ru: Не удалось применить водяной знак.

source: Could not build the GIF.
ru: Не удалось собрать GIF.

source: Could not build the comparison.
ru: Не удалось собрать сравнение.

source: Could not build the mosaic.
ru: Не удалось собрать мозаику.

source: Could not compare the pictures.
ru: Не удалось сравнить изображения.

source: Could not correct the perspective.
ru: Не удалось выровнять перспективу.

source: Could not crop the image.
ru: Не удалось обрезать изображение.

source: Could not cut the image. Check the range.
ru: Не удалось вырезать фрагмент. Проверьте диапазон.

source: Could not decode the Base64 string.
ru: Не удалось декодировать строку Base64.

source: Could not decode the cover art.
ru: Не удалось декодировать обложку.

source: Could not encode the cover art.
ru: Не удалось закодировать обложку.

source: Could not export the picture with this profile.
ru: Не удалось экспортировать изображение с этим профилем.

source: Could not export this photo.
ru: Не удалось экспортировать это фото.

source: Could not fit the image into this size.
ru: Не удалось вписать изображение в этот размер.

source: Could not hide the text. The picture may be too small.
ru: Не удалось спрятать текст. Возможно, изображение слишком маленькое.

source: Could not load the picture.
ru: Не удалось загрузить изображение.

source: Could not load the target picture.
ru: Не удалось загрузить целевое изображение.

source: Could not make the APNG. All frames must have the same size.
ru: Не удалось собрать APNG. Все кадры должны быть одного размера.

source: Could not make the GIF.
ru: Не удалось собрать GIF.

source: Could not read one of the pictures.
ru: Не удалось прочитать одно из изображений.

source: Could not read the image.
ru: Не удалось прочитать изображение.

source: Could not read the mask picture.
ru: Не удалось прочитать изображение-маску.

source: Could not read the overlay picture.
ru: Не удалось прочитать изображение-наложение.

source: Could not read the picture.
ru: Не удалось прочитать изображение.

source: Could not read the selected file.
ru: Не удалось прочитать выбранный файл.

source: Could not read this audio file.
ru: Не удалось прочитать этот аудиофайл.

source: Could not read this photo.
ru: Не удалось прочитать это фото.

source: Could not render the PDF.
ru: Не удалось создать PDF.

source: Could not render the code.
ru: Не удалось отрисовать код.

source: Could not render the frame.
ru: Не удалось отрисовать рамку.

source: Could not render the gradient.
ru: Не удалось отрисовать градиент.

source: Could not render the mesh gradient.
ru: Не удалось отрисовать mesh-градиент.

source: Could not resize the image.
ru: Не удалось изменить размер изображения.

source: Could not split the image. Try fewer parts.
ru: Не удалось разрезать изображение. Попробуйте меньше частей.

source: Could not stack the images.
ru: Не удалось сложить изображения.

source: Could not stitch the images.
ru: Не удалось склеить изображения.

source: Crop
ru: Обрезка

source: Cut
ru: Вырезать

source: Cut corners
ru: Срезанные углы

source: Dark
ru: Тёмная

source: Decode
ru: Декодировать

source: Delete EXIF
ru: Удаление EXIF

source: Diamond
ru: Ромб

source: Different
ru: Разные

source: Differing pixels
ru: Отличающиеся пиксели

source: Digest
ru: Дайджест

source: Direction
ru: Направление

source: Document scanner
ru: Сканер документов

source: Done
ru: Готово

source: Downloading
ru: Загрузка

source: Drag over the image
ru: Проведите по изображению

source: Droplet
ru: Капля

source: Duplicate finder
ru: Поиск дубликатов

source: Duration: %@ s
ru: Длительность: %@ с

source: Easter egg
ru: Пасхалка

source: Edit EXIF
ru: Редактирование EXIF

source: Egg
ru: Яйцо

source: Encoded %lld characters
ru: Закодировано символов: %lld

source: Enhanced heart
ru: Расширенное сердце

source: Enter a valid http or https address.
ru: Введите корректный адрес http или https.

source: Enter at least one valid hex colour.
ru: Введите хотя бы один корректный HEX-цвет.

source: Exact duplicates
ru: Точные дубликаты

source: Example: %@
ru: Пример: %@

source: Explosion
ru: Взрыв

source: Export
ru: Экспорт

source: Export all
ru: Экспорт всех

source: Export animated GIF
ru: Экспортировать анимированный GIF

source: Export mesh PNG
ru: Экспортировать mesh PNG

source: Exporting %lld of %lld
ru: Экспорт %lld из %lld

source: Extract
ru: Извлечь

source: File
ru: Файл

source: File names
ru: Имена файлов

source: Fill
ru: Заполнить

source: Find duplicates
ru: Найти дубликаты

source: Fit
ru: Вписать

source: Fit to size
ru: Подогнать под размер

source: Flakes
ru: Снежинки

source: Flip horizontal
ru: Отразить по горизонтали

source: Flip vertical
ru: Отразить по вертикали

source: Font size
ru: Размер шрифта

source: Format
ru: Формат

source: Frame
ru: Кадр

source: Frame delay (s)
ru: Задержка кадра (с)

source: Frames: %lld
ru: Кадров: %lld

source: Free
ru: Свободно

source: From
ru: От

source: GIF tools
ru: Инструменты GIF

source: Generate
ru: Сгенерировать

source: Gradients and mesh
ru: Градиенты и mesh

source: Grid
ru: Сетка

source: Harmonies
ru: Гармонии

source: Heart
ru: Сердце

source: Height
ru: Высота

source: Help
ru: Справка

source: Hexagon
ru: Шестиугольник

source: Hide in picture
ru: Спрятать в изображении

source: Hide text
ru: Спрятать текст

source: Horizontal
ru: Горизонтально

source: Horizontal lines
ru: Горизонтальные линии

source: Image
ru: Изображение

source: Image cutting
ru: Вырезание фрагмента

source: Image logic package of this project.
ru: Пакет обработки изображений этого проекта.

source: Image preview
ru: Просмотр изображений

source: Image splitting
ru: Разрезание изображения

source: Image stacking
ru: Наложение изображений

source: Image stitching
ru: Склейка изображений

source: Image to Base64
ru: Изображение в Base64

source: Images
ru: Изображения

source: In-house
ru: Собственная разработка

source: Input
ru: Ввод

source: Invert
ru: Инвертировать

source: Keep aspect ratio
ru: Сохранять пропорции

source: Keep metadata
ru: Сохранять метаданные

source: Keep only the cut part
ru: Оставить только вырезанный фрагмент

source: Kotlin logo
ru: Логотип Kotlin

source: Language
ru: Язык

source: Last hour
ru: Последний час

source: Layout
ru: Расположение

source: Libraries
ru: Лицензии

source: Light
ru: Светлая

source: Limit size
ru: Ограничить размер

source: Limits
ru: Ограничения

source: Line numbers
ru: Номера строк

source: Linear
ru: Линейный

source: Lines
ru: Строки

source: Live camera scanning is not part of this screen.
ru: Сканирование камерой в реальном времени на этом экране не реализовано.

source: Load
ru: Загрузить

source: Load image from URL
ru: Загрузка по ссылке

source: Loaded: %lld
ru: Загружено: %lld

source: Loading colours
ru: Загрузка цветов

source: Make APNG
ru: Собрать APNG

source: Make GIF
ru: Собрать GIF

source: Make PDF
ru: Создать PDF

source: Map pin
ru: Метка на карте

source: Match
ru: Совпадает

source: Material star
ru: Материальная звезда

source: Maximum
ru: Максимум

source: Maximum height
ru: Максимальная высота

source: Maximum width
ru: Максимальная ширина

source: Median
ru: Медиана

source: Mesh gradient
ru: Mesh-градиент

source: Metadata
ru: Метаданные

source: Metrics
ru: Метрики

source: Minimum
ru: Минимум

source: Mix
ru: Смешение

source: Mix with white
ru: Смешать с белым

source: Mode
ru: Режим

source: Mosaic
ru: Мозаика

source: Name
ru: Имя

source: Name or #hex
ru: Название или #hex

source: Name template
ru: Шаблон имени

source: Names
ru: Названия

source: No codes found
ru: Коды не найдены

source: No colours could be found in this picture.
ru: В этом изображении не удалось найти цвета.

source: No document found
ru: Документ не найден

source: No help topics match this search.
ru: По этому запросу тем справки нет.

source: No hidden text found
ru: Скрытый текст не найден

source: No metadata found.
ru: Метаданные не найдены.

source: No tile pictures could be loaded.
ru: Не удалось загрузить изображения-плитки.

source: No tools have been opened yet.
ru: Инструменты ещё не открывались.

source: None
ru: Нет

source: Octagon
ru: Восьмиугольник

source: Octaves
ru: Октавы

source: Only http and https addresses are supported.
ru: Поддерживаются только адреса http и https.

source: Opacity
ru: Непрозрачность

source: Open text file
ru: Открыть текстовый файл

source: Or type text
ru: Или введите текст

source: Original Android project by T8RIN.
ru: Исходный проект для Android от T8RIN.

source: Output
ru: Вывод

source: Output: %lld × %lld px
ru: Результат: %lld × %lld пикс.

source: Oval
ru: Овал

source: Padding
ru: Отступы

source: Palette from picture
ru: Палитра из изображения

source: Palette to PDF
ru: Палитра в PDF

source: Parameters
ru: Параметры

source: Parts
ru: Части

source: Parts: %lld
ru: Частей: %lld

source: Paste
ru: Вставить

source: Paste Base64 text here
ru: Вставьте текст Base64

source: Pattern
ru: Шаблон

source: Pentagon
ru: Пятиугольник

source: Perlin noise
ru: Шум Перлина

source: Persistence
ru: Устойчивость

source: Photo
ru: Фото

source: Photomosaic
ru: Фотомозаика

source: Pick both pictures to compare them.
ru: Выберите оба изображения для сравнения.

source: Picture
ru: Изображение

source: Pictures
ru: Изображения

source: Pill
ru: Капсула

source: Ping-pong
ru: Туда-обратно

source: Position
ru: Положение

source: Prepare files
ru: Подготовить файлы

source: Preview
ru: Предпросмотр

source: Profile
ru: Профиль

source: Quality
ru: Качество

source: Quality: %@
ru: Качество: %@

source: Radial
ru: Радиальный

source: Random name
ru: Случайное имя

source: Read APNG
ru: Прочитать APNG

source: Read hidden text
ru: Прочитать скрытый текст

source: Rectangle
ru: Прямоугольник

source: Redo
ru: Повторить

source: Refresh
ru: Обновить

source: Remove
ru: Удалить

source: Remove mask
ru: Убрать маску

source: Remove metadata
ru: Удалить метаданные

source: Remove overlay
ru: Убрать наложение

source: Remove stop
ru: Удалить опорную точку

source: Render
ru: Отрисовать

source: Repeat across the picture
ru: Повторять по всему изображению

source: Replace text with the current date and time
ru: Заменить текст текущими датой и временем

source: Reset
ru: Сбросить

source: Resize
ru: Изменение размера

source: Resize and convert
ru: Изменить размер и конвертировать

source: Resize to file size
ru: Изменить до размера файла

source: Resize within limits
ru: Изменить в пределах ограничений

source: Result
ru: Результат

source: Rotate and flip
ru: Поворот и отражение

source: Rotate left
ru: Повернуть влево

source: Rotate right
ru: Повернуть вправо

source: Rotation
ru: Поворот

source: Rounded pentagon
ru: Скруглённый пятиугольник

source: Rounded rectangle
ru: Скруглённый прямоугольник

source: Rounded triangle
ru: Скруглённый треугольник

source: Rows
ru: Строки

source: Rows after removal: %lld
ru: Строк после удаления: %lld

source: Rows before removal: %lld
ru: Строк до удаления: %lld

source: Save
ru: Сохранить

source: Save to Files
ru: Сохранить в Файлы

source: Scale
ru: Масштаб

source: Scan QR and barcodes
ru: Сканирование QR и штрихкодов

source: Screen size
ru: Размер экрана

source: Screenshot framing
ru: Рамка для скриншота

source: Search
ru: Поиск

source: Search help
ru: Поиск по справке

source: Search tools
ru: Поиск инструментов

source: Seed
ru: Зерно

source: Separate hex colours with spaces or new lines.
ru: Разделяйте HEX-цвета пробелами или переводами строк.

source: Settings
ru: Настройки

source: Shadow
ru: Тень

source: Shape
ru: Форма

source: Share
ru: Поделиться

source: Share APNG
ru: Поделиться APNG

source: Share GIF
ru: Поделиться GIF

source: Share PDF
ru: Поделиться PDF

source: Share PNG
ru: Поделиться PNG

source: Share all %lld files
ru: Поделиться всеми (%lld)

source: Share edited file
ru: Поделиться изменённым файлом

source: Share file
ru: Поделиться файлом

source: Share mesh PNG
ru: Поделиться mesh PNG

source: Share stripped file
ru: Поделиться файлом без метаданных

source: Share wallpaper
ru: Поделиться обоями

source: Sharp star
ru: Острая звезда

source: Shield
ru: Щит

source: Shuriken
ru: Сюрикен

source: Side by side
ru: Рядом

source: Similar pictures
ru: Похожие изображения

source: Similarity threshold
ru: Порог похожести

source: Single edit and export profiles
ru: Редактирование и профили экспорта

source: Size
ru: Размер

source: Size: %@ KB
ru: Размер: %@ КБ

source: Slider
ru: Ползунок

source: Snowfall
ru: Снегопад

source: Some images could not be read.
ru: Часть изображений не удалось прочитать.

source: Source
ru: Источник

source: Spacing
ru: Интервал

source: Split
ru: Разделение

source: Split complementary
ru: Раздвоенные дополнительные

source: Square (1:1)
ru: Квадрат (1:1)

source: Squircle
ru: Суперэллипс

source: Stack
ru: Стек

source: Star
ru: Звезда

source: Stitch
ru: Склейка

source: Stops
ru: Опорные точки

source: Stretch
ru: Растянуть

source: Style
ru: Стиль

source: Target
ru: Цель

source: Target picture
ru: Целевое изображение

source: Target size
ru: Целевой размер

source: Template
ru: Шаблон

source: Tetradic
ru: Тетрадные

source: Text
ru: Текст

source: Text fields
ru: Текстовые поля

source: The address does not point to an image.
ru: Адрес не указывает на изображение.

source: The app log could not be read.
ru: Не удалось прочитать журнал приложения.

source: The batch stopped because a picture could not be encoded.
ru: Пакет остановлен: одну из картинок не удалось закодировать.

source: The colour library could not be loaded.
ru: Не удалось загрузить библиотеку цветов.

source: The downloaded file could not be decoded.
ru: Не удалось декодировать загруженный файл.

source: The file could not be opened.
ru: Не удалось открыть файл.

source: The file is hashed. Remove it to type text instead.
ru: Файл хешируется. Уберите его, чтобы ввести текст.

source: The image could not be downloaded.
ru: Не удалось загрузить изображение.

source: The image could not be encoded as %@.
ru: Не удалось закодировать изображение в %@.

source: The image could not be transformed.
ru: Не удалось преобразовать изображение.

source: The image file is too large.
ru: Файл изображения слишком большой.

source: The metadata could not be removed from this image.
ru: Не удалось удалить метаданные из этого изображения.

source: The metadata could not be saved to this image.
ru: Не удалось сохранить метаданные в это изображение.

source: The picked file could not be read as an image.
ru: Выбранный файл не удалось прочитать как изображение.

source: The picked image could not be read.
ru: Выбранное изображение не удалось прочитать.

source: The picture could not be generated.
ru: Не удалось создать изображение.

source: The pixels of this image could not be read.
ru: Не удалось прочитать пиксели этого изображения.

source: The server answered with status %lld.
ru: Сервер ответил кодом %lld.

source: Theme
ru: Тема

source: This file could not be decoded as WebP.
ru: Этот файл не удалось декодировать как WebP.

source: This file could not be read as a PNG.
ru: Этот файл не удалось прочитать как PNG.

source: This file could not be read as an image.
ru: Этот файл не удалось прочитать как изображение.

source: This file has no cover art
ru: В этом файле нет обложки

source: This screen reads WebP and saves the picture as PNG, JPEG, HEIC or WebP. WebP is encoded with libwebp.
ru: Этот экран читает WebP и сохраняет изображение как PNG, JPEG, HEIC или WebP. WebP кодируется библиотекой libwebp.

source: Tile pictures
ru: Изображения-плитки

source: Tile size
ru: Размер плитки

source: Tiles loaded: %lld
ru: Загружено плиток: %lld

source: Timestamp
ru: Отметка времени

source: To
ru: До

source: Tokens: {name}, {ext}, {n}, {n:3}, {date:yyyy-MM-dd}
ru: Переменные: {name}, {ext}, {n}, {n:3}, {date:yyyy-MM-dd}

source: Tool name
ru: Имя инструмента

source: Top tools
ru: Популярные инструменты

source: Total opens
ru: Всего открытий

source: Transform
ru: Преобразование

source: Triadic
ru: Триадные

source: Triangle
ru: Треугольник

source: Type
ru: Тип

source: Undo
ru: Отменить

source: Usage statistics
ru: Статистика использования

source: Vertical
ru: Вертикально

source: Vertical lines
ru: Вертикальные линии

source: Wallpapers export
ru: Экспорт обоев

source: Watermarks
ru: Водяные знаки

source: WebP tools
ru: Инструменты WebP

source: Width
ru: Ширина
